levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/example/dmac/dmac_repeat/EWARM/startup_hc32m423.s
                PUBWEAK IRQ081_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ081_Handler
                B       IRQ081_Handler

                PUBWEAK IRQ082_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ082_Handler
                B       IRQ082_Handler

                PUBWEAK IRQ083_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ083_Handler
                B       IRQ083_Handler

                PUBWEAK IRQ084_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ084_Handler
                B       IRQ084_Handler

                PUBWEAK IRQ085_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ085_Handler
                B       IRQ085_Handler

                PUBWEAK IRQ086_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ086_Handler
                B       IRQ086_Handler

                PUBWEAK IRQ087_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ087_Handler
                B       IRQ087_Handler

                PUBWEAK IRQ088_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ088_Handler
                B       IRQ088_Handler

                PUBWEAK IRQ089_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ089_Handler
                B       IRQ089_Handler

                PUBWEAK IRQ090_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ090_Handler
                B       IRQ090_Handler

                PUBWEAK IRQ091_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ091_Handler
                B       IRQ091_Handler

                PUBWEAK IRQ092_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ092_Handler
                B       IRQ092_Handler

                PUBWEAK IRQ093_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ093_Handler
                B       IRQ093_Handler

                PUBWEAK IRQ094_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ094_Handler
                B       IRQ094_Handler

                PUBWEAK IRQ095_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ095_Handler
                B       IRQ095_Handler

                PUBWEAK IRQ096_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ096_Handler
                B       IRQ096_Handler

                PUBWEAK IRQ097_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ097_Handler
                B       IRQ097_Handler

                PUBWEAK IRQ098_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ098_Handler
                B       IRQ098_Handler

                PUBWEAK IRQ099_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ099_Handler
                B       IRQ099_Handler

                PUBWEAK IRQ100_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ100_Handler
                B       IRQ100_Handler

                END
